---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveRight
source: html/dfbff3af-27ed-1c68-7a07-d6c244a1bea6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveRight Property

"Right Clip Active"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerBoundActiveRight { get; }
```